{
  "repeater": {
    "repeater": "PDJ Media Repeater",
    "nameRepeater": "REPEATER",
    "playFavoriteList": "Play Favorite List",
    "fav": "Favorite",
    "settings": "Settings",
    "switchsubtitleLanguages": "Switch Subtitle Lines",
    "editSubandNote": "Edit subtitle and annotation",
    "singleSentenceRepetitionMode": "Single Sentence Repetition Mode",
    "regularMode": "Regular Mode",
    "note1": "Please use standard browser - Edge, Chrome, Safari or Firefox to ensure PDJ Media Repeater can work correctly.",
    "note2": "For Android Phone in China, please use Official",
    "note3": "Other browsers may not support uttering translation lines with system TTS(will auto switch to online TTS service), or may hijack video or audio tag to make PDJ media repeater losing control of the media file.",
    "sentencePlaybackTimes": "Sentence Playback Times:",
    "interval": "Interval (in second):",
    "timestampMove": "Move of StartTime for all subtitles (in ms):",
    "timestampMoveEnd": "Move of EndTime for all subtitles (in ms):",  
    "speedEachTime": "Speed Each Time (default:1):",
    "autoPlayCurrentSentence": "Auto Play Current Sentence",
    "autoSwitchtoNextSentence": "Auto Switch to Next Sentence (Disabled while editing)",    
    "utterSubtitle": "Utter Subtitle's Translation Line with TTS",
    "autoDetect": "auto-detect",
    "systemTTS": "Use System Built-In TTS",
    "SystemTTSnote": "Simple, Fast and Steady",
    "notSystemTTS": "Use Online TTS Service",
    "testTTSurl": "Test Online TTS Service",
    "notSystemTTSnote": "The default TTS API address maybe invalid. You can change it to any other online TTS API address (Test it firstly). ",
    "langInTransLine": "Language Used In translation Line:",
    "lineNumOfTrans": "Line Number Of Translation In Subtitle:",
    "testTTSVoice": "Voice Test",
    "voice": "Voice (Your browser has {totalvoices} voices for this language, including online voices):",
    "pauseTime": "Pause Time (in second):",    
    "speedOfUttering": "Speed Of Uttering:",
    "replayFromStart": "SingleClick to Replay Current Sentence from the First Time",
    "utterTransFirstly": "Utter Subtitle's Translation Line Firstly",
    "autoPauseAfterFirstDone": "AutoPause After Uttering Translation Line or Playing Current Sentence Firstly, And Click To Continue.",
    "playFullFavList": "Play All Favorite Sentenses in Current User's Root Folder When Playing Favorite List (In this mode, autoPlay current sentence is not allowed due to browser's restriction.)",
    "allowCache": "Cache Media - Enable to Save Visited Media Files in Browser's Cache. This will hugely save traffic usage in the next visit, but will take up storage space on this device (After this setting is changed, it will automatically reload current page to make it effective). In 'Offline APP Mode', 'Cache Media' will be selected automatically and cannot be changed.",
    "cached1": "Max number of latest files to cache:",
    "savedfiles": "Number of media files saved in this Browser's Cache: {numOfKeys}",
    "cleanUpCache": "Clean UP",
    "allowOfflineL": "Offline APP Mode",
    "offlineApp": "Offline APP mode - This mode can be used normally with or without a network: When there is a network, files in the browser cache will be prioritized for use. If there are no required files in the cache, they will be downloaded from the server and stored in the browser cache; This mode can also be used normally when there is no network (client cannot connect to the network or server is turned off), but only cached files can be used, and uncached files will not be displayed. This mode can still perform editing subtitles and settings when there is no network, and it will automatically update to the server after connecting to the server. When this mode is turned off, regardless of whether it is connected to the internet or whether there is a cache of the required files in the browser, an update cache request will be sent to the server (the resources in 'cache media' are stored in a dedicated database and are not controlled by this). If it is not connected to the internet, an error page will be displayed. It is recommended to use this Offline APP Mode for daily use to ensure maximum smoothness and minimal data consumption. Only when the server content is modified, this mode needs to be turned off to update the browser cache. This mode will automatically log in using the cached account information. Please change this mode on the login page.",
    "addnewWord": "Add a New Word or Phrase",
    "instructions": "INSTRUCTIONS",
    "instruction1": "Click (DOWN arrow key on keyboard): replay current sentence",  
    "instruction2": "DoubleClick (UP arrow key on keyboard): stop playing",
    "instruction3": "Swipe Left (RIGHT arrow key on keyboard): jump to next sentence",
    "instruction4": "Swipe Right (LEFT arrow key on keyboard): jump to previous sentence",     
    "instruction5": "Swipe Up: add to favorites (Or remove a favorite when playing Favorite List)",
    "instruction6": "Swipe Down: close this player",
    "clickButton": "Click button",
    "instruction14": ": Review",     
    "instruction7": ": switch Playback Mode between 'Single Sentence Repetition Mode' and 'Regular Mode'. The RED icon indicates the media file stored in the browser cache is being played.",
    "instruction8": ": switch Subtitle in 8 Modes. Especially, while editing in red Mode, you can practice DICTATION.",
    "instruction9": ": show SETTINGS, INSTRUCTIONS, UPDATES and COMMENTS",         
    "instruction10": ": play sentences in favorite List", 
    "instruction13": ": edit subtitle and annotation, add or remove a new word or phrase", 
    "instruction11": ": add or remove a favorite sentence.", 
    "clickandInput": "Click", 
    "instruction12": ": show Subtitle List, New Words Test or New Words List. Click the item in the list to switch Current Sentence.",                 	    
    "learnLangUsingPDJ": "To Learn A Language Using PDJ Media Repeater",
    "learnLang1": "There are two very effective methods to learn a language: Shadowing and Reciting. For shadowing, you need listen to a sentence firstly, and then repeat it yourself immediately (maybe in mind). For reciting, you need read or listen to a sentence in your mother language firstly, and then translate to the new language immediately.",
    "learnLang2": "The key to the success of these two methods lies in REPETITION, a large amount of REPETITION, until a permanent conditioned reflex is formed! For the same sentence, you need to repeat shadowing and reciting it again and again (maybe 100 times in a year) to make it as familiar as your mother language. This is a boring and time-consuming job with no obvious effects in short time.",
    "learnLang3": "With PDJ Media Repeater, you can do shadowing and reciting easier, and the 'Review' function will ensure that you can obtain efficient and sufficient repetition times. Just choose a video or audio with 20-50 sentences every week, and repeat shadowing and reciting them every morning and evening 2 or 3 times. You can lie in your bed, close your eyes, and click, or swipe left, up in your cell phone to learn the language. Thus, in one year, you may master thousands of sentences as fluent as your mother language. That will be a big improvement.",        
    "updatesandComments": "UPDATES、COMMENTS and Resource Sharing",
    "github": "Project on Github:",
    "youdao": "YouDao Notes:",
    "baiduyun": "Resource Sharing:",
    "resetTTSurl": "RESET to default URL",
    "revise": "REVIEW",
    "revise1": "Current Learning",    
    "revise2": "Review Date (day): ",
    "revise3": "Add to Review Plan",          
    "revise4": "Sentence:",
    "delThisRevision": "Delete this Review",    
    "delThisRevision2": "Are you sure to delete this review?",
    "removeRevisionConfirm": "Unable to connect to the network, or the media file and subtitle file for this review have been moved or deleted on the server! Clicking 'confirm' will delete this review item. If necessary, please manually add again; Or click 'Cancel' to close and try again after connecting to the internet or in 'Offline APP Mode'.",  
    "revise5": "Marked as 'Reviewed'",
    "revise55": "Marked as 'Haven't Reviewed'",
    "confirmDelete": "Are you sure to delete Current Sentence?",
    "confirmMerge": "Are you sure to merge Current Sentence to Next Sentence?",
    "confirmAdd": "Are you sure to add a New Sentence after Current Sentence?",
    "infoDelete": "Delete Current Sentence",
    "infoMerge": "Merge Current Sentence to Next Sentence",
    "infoAdd": "Add a New Sentence after Current Sentence",
    "slowInternet": "Slow Internet or Media Source switched! Replay...",
    "undo": "Undo",
    "redo": "Redo",
    "notAllowSaveInoffline": "Not allowed to automatically save modified settings and subtitles to the server in Offline APP Mode. These modifications will be saved in browser cache and automatically updated to the server after turning off the Offline APP Mode. This setting can only be changed when Offline APP Mode is off.",
    "newWordTest": "New Words and Phrases Test",
    "newWordList": "New Words and Phrases List",    
    "RUdoAlert": "Done! When restoring deleted or merged sentence, the favorite status may not be restored correctly, please adjust manually.",           
    "cached": "Media Cached! Switching...",
    "cleanCache": "Clean up specified browser cache.",
    "cleanCacheDone": "Selected caches have been cleaned up!",
    "cleanAccount": "Clear the login info in browser cache. Then, login in 'Offline APP mode' will not be disabled.",
    "cleanMedia": "Clear cached media files and To Do List's attachments in the browser!",
    "cleanSrtandSettings": "Clear other files in browser cache, including subtitles, settings, To Do List and attachments that have been modified but may not have been synchronized to the server!",
    "cleanAlert": "Tip: Moving or deleting files on the server may make favorite sentences and review plans stored in the config file 'PDJ-Repeater.txt' in current user's /!PDJ folder on the server invalid! If necessary, please manually delete the 'PDJ-Repeater.txt' on the server, and re-add the favorite sentences and review plans.",
    "wrongSrc": "Media file loading failed! It has been moved on the server or there is an error in the media cache. Click 'confirm' to automatically cancel the favorite status of this sentence and clear the cached media. Or click 'cancel' to clear the cached media only.",
    "noFavoriteFile": "Unable to read the user config file '{favFileName}' in current user's /!PDJ folder on the server! If you are using the PDJ Media Repeater for the first time, please click 'confirm' and this config file will be automatically created; If it is due to network issues, please click 'Cancel' to exit, and try again after connecting to the internet or switching to 'Offline APP Mode'. The PDJ media repeater will automatically cache accessed data for offline use, which can be cleared on the login page. Meanwhile, when using the subtitle editing function, the original .srt file will be modified. If necessary, please make a backup in advance.", 
    "speechsynthesisAlert": "Sorry, your browser does not support standard 'speechSynthesis API', and it can't utter the subtitle's translation line with system embedded TTS, this setting is disabled automatically. It is recommended to use a standard browser. Android phone users in China are recommended to use the original Firefox browser, which can call the system's built-in TTS service on Android phones without Google Framework.",
    "warning1": "Video or audeo tag is hijacked by this browser. This browser may not fully comply with HTML5 standard. Please restart your browser to retry. Or change to a standard browser: Edge, Chrome, Safari or Firefox to ensure PDJ Media Repeater can work correctly."    
  },
  "reminder": {
    "reminder": "PDJ Universal To Do List",
    "nameReminder": "ToDo LIST",
    "logout": "Logout",
    "addNew": "Add A New Task",
    "return": "return without saving",
    "upload": "Upload to server", 
    "isBackUp": "Automatically backup PDJ-ToDoList.txt to the folder !PDJ\\ToDoList-attachments when task content changes.",
    "tags": "Tags:",
    "tag": "Tags",
    "lastReviewedDate": "Last Done:",
    "remembered": "Remembered",
    "forgot": "Forgotten",
    "forgot1": "Marked as 'to do'. The start date for this Recitation task has been reset to today and will restart this Recitation from the first day.",
    "forgot2": "Marked as 'to do'. As a Important task, this Recitation task will continue to be reminded tomorrow until 'Remembered' is clicked.",
    "forgot3": "Marked as 'to do'",
    "remembered1": "Marked as 'done'",
    "fromFirstDay": "When clicking on 'forgotten' on the page of Recitation task, reset Today as the Recitation plan's start date and it will restart reciting from the first day. Otherwise, it will only be marked as 'To Do' (but if it is an important task, it will continue to be reminded the next day).",  
    "edit": "Edit current task",
    "delete": "Delete current task",
    "deleteConfirm": "Are you sure to Delete Current Task?",
    "frontSide": "FRONT",
    "backSide": "BACK",
    "dailyList": "Daily To Do List",
    "wholeList": "Whole List",
    "markedAll": "Mark all 'To Do' Tasks on current and previous dates as 'Done'",
    "switchStatus": "Switch Status",
    "submit": "Submit",
    "switchImportant": "Switch importance",
    "types": "Types:",
    "editTask": "Edit Current Task",
    "Regular Task": "Regular Task",
    "Recitation Task": "Recitation Task",
    "Memo": "Memo",
    "specials": "Others:",
    "important1": "Important Task: will be displayed in the Daily To Do List (in red) even if it's out of date but hasn't been done.",
    "important": " Important Task",
    "important2": "Important Task: will be displayed in the Whole List in red color.",
    "With Attachments": "Task with Attachments",  
    "front": "Front Side of the Task Card",
    "back": "Back Side of the Task Card",
    "repDate": "Repitation Dates",
    "every": "every",
    "custom": "Custom Dates",
    "once": "Once",
    "startDate": "Start Date of the Task:",
    "endDate": "End Date of the Task:",
    "neverEnd": "Forever",
    "comingDate": "Doublecheck the latest 4 coming Repitation Dates:",
    "execTime": "Execution Time:",
    "attach": "Attachment",
    "mon": "Monday",
    "tue": "Tuesday",
    "wed": "Wednesday",
    "thu": "Thursday",
    "fri": "Friday",
    "sat": "Saturday",
    "sun": "Sunday",
    "ebbinghaus": "Ebbinghaus Forgetting Curve",
    "days": "Num of Days from Start Date:",
    "none": "none",
    "outOfDate": "OutOfDate",
    "utter": "Read Task's Content using TTS",
    "langinfrontside": "Language in Task Card's Front Side:",
    "speedOfUttering": "Speed Of Uttering:",
    "langInbackside": "Language in Task Card's Back Side:",
    "frontWithLang": "TTS API for Front Side",
    "backWithLang": "TTS API for Back Side",
    "noContent": "No content!",
    "unmatch": "The PDJ-ToDoList.txt file on the server has been modified by another client. Click 'Confirm' to update the browser cache based on the server content. Click 'Cancel' to continue to use the cached content in this browser and save it to the server.",
    "leaveWithoutSave": "Return without Saving?",
    "alert1": "Front Page of the Task Card can't be empty!",
    "alert2": "Selected day of week can't be empty!",
    "alert3": "Date for Ebbinghaus Forgetting Curve can't be empty!",
    "alert4": "Date for Custom Dates can't be empty!",
    "alert5": "End Date should not be smaller than Start Date.",
    "attachChanged": "The attachments have been changed and saved. Cannot exit without saving. Please click the save button to exit the editing mode.",
    "offlineApp": "Offline APP mode - This mode can be used normally with or without a network: When there is a network, files in the browser cache will be prioritized for use. If there are no required files in the cache, they will be downloaded from the server and stored in the browser cache; This mode can also be used normally when there is no network (client cannot connect to the network or server is turned off), but only cached files can be used, and uncached files will not be displayed. This mode can still perform adding or editing Tasks, attachments when there is no network, and it will automatically update to the server after connecting to the server. When this mode is turned off, regardless of whether it is connected to the internet or whether there is a cache of the required files in the browser, an update cache request will be sent to the server. If it is not connected to the internet, an error page will be displayed.This mode will automatically log in using the cached account information. Please change this mode on the login page.",
    "noTodoListFile": "Unable to read the user config file '{favFileName}' in current user's /!PDJ folder on the server! If you are using the PDJ Universal To Do List for the first time, please click 'confirm' and this config file will be automatically created; If it is due to network issues, please click 'Cancel' to exit, and try again after connecting to the internet or switching to 'Offline APP Mode'. The PDJ Universal To Do List will automatically cache accessed data for offline use, which can be cleared on the login page.", 
    "uploadUnsaved": " There are task contents and attachments that have been modified but not synchronized to the server. Clicking 'confirm' will attempt to synchronize to the server. If you want to abandon these modifications, please click 'Cancel' and clear all caches after logging out, and Re-login while connected to the server to rebuild the browser cache from the server.",
    "status01": "To Do",
    "status02": "Done",
    "status03": "Not Due",  
    "ins01": "Welcome to Use PDJ Universal To Do List!", 
    "ins02": "Click",
    "ins03": " to add a new task.",  
    "ins04": "1. Select the Task Types, including Regular Task, Recitation Task, and Memo.",  
    "ins05": "2. Input contents of the Front Side and Back Side of the Task Card, and upload attachments (No limit to the size of each attachment, but attachments larger than 300 MB will not be cached in the browser and cannot be visited without network).",  
    "ins06": "3. Input tags (seperate with ';').",  
    "ins07": "4. Input Repitation Dates (Memo Task doesn't have Repitaion Dates). The PDJ Universal To Do List provides many Types of repitation dates.",  
    "ins08": "5. Input Task's Start Date, End Date and Execution Time. Then click the Save button to show it in the list.",  
    "ins09": "In the listing Page, click",  
    "ins10": " to switch between 'Daily To Do List' and 'Whole List'.",  
    "ins11": "1. The search box at the top of the list page can be used to search for task content. Click on the ",  
    "ins12": "can quickly search for task types and tags.",  
    "ins13": "2. In the Daily To Do List, you can click on ",  
    "ins14": " to change the task status.",  
    "ins15": "3. Memo tasks will not be displayed in the Daily To Do List.",  
    "ins16": "4. Clicking on each item in the list will take you to the Task Details page.",  
    "ins17": "On the Task Details page, you can browse each task and perform editing and deleting operations.",  
    "ins18": "1. Swipe left or right to switch tasks.",
    "ins19": "2. Swipe up and down to switch between the Front and Back Side of the Task Card.",   
    "ins20": "3. Single click on the page to read the content of the task card using TTS. Click on the attachment to display its contents.",  
    "ins21": "4. Double click on the page to enter the Task Editing page.",  
    "ins22": "Remarks:",    
    "ins23": "The PDJ Universal To Do List can be used both OnLine and OffLine (When using Offline, Offline APP Mode needs to be enabled on the Login page).",
    "ins24": "You can set the account language in the PDJ Media Repeater to change the display language of the PDJ Universal To Do List.",  
    "ins25": "You can back up the complete PDJ Universal To Do List by backing up the !PDJ folder in the user's root directory on the server. And the PDJ Universal To Do List will automatically backup the file PDJ-ToDoList.txt to the folder !PDJ/ToDoList-attachments after each task modification." 
  },
  "buttons": {
    "cancel": "Cancel",
    "close": "Close",
    "copy": "Copy",
    "copyFile": "Copy file",
    "copyToClipboard": "Copy to clipboard",
    "copyDownloadLinkToClipboard": "Copy download link to clipboard",
    "create": "Create",
    "delete": "Delete",
    "download": "Download",
    "file": "File",
    "folder": "Folder",
    "hideDotfiles": "Hide dotfiles",
    "info": "Info",
    "more": "More",
    "move": "Move",
    "moveFile": "Move file",
    "new": "New",
    "next": "Next",
    "ok": "OK",
    "permalink": "Get Permanent Link",
    "previous": "Previous",
    "publish": "Publish",
    "rename": "Rename",
    "replace": "Replace",
    "reportIssue": "Report Issue",
    "save": "Save",
    "schedule": "Schedule",
    "search": "Search",
    "select": "Select",
    "selectMultiple": "Select multiple",
    "share": "Share",
    "shell": "Toggle shell",
    "submit": "Submit",
    "switchView": "Switch view",
    "toggleSidebar": "Toggle sidebar",
    "update": "Update",
    "upload": "Upload",
    "openFile": "Open file",
    "continue": "Continue",
    "discardChanges": "Discard"
  },
  "download": {
    "downloadFile": "Download File",
    "downloadFolder": "Download Folder",
    "downloadSelected": "Download Selected"
  },
  "upload": {
    "abortUpload": "Are you sure you wish to abort?"
  },
  "errors": {
    "forbidden": "You don't have permissions to access this.",
    "internal": "Something really went wrong.",
    "notFound": "This location can't be reached.",
    "connection": "The server can't be reached."
  },
  "files": {
    "body": "Body",
    "clear": "Clear",
    "closePreview": "Close preview",
    "files": "Files",
    "folders": "Folders",
    "home": "Home",
    "lastModified": "Last modified",
    "loading": "Loading...",
    "lonely": "It feels lonely here...",
    "metadata": "Metadata",
    "multipleSelectionEnabled": "Multiple selection enabled",
    "name": "Name",
    "size": "Size",
    "sortByLastModified": "Sort by last modified",
    "sortByName": "Sort by name",
    "sortBySize": "Sort by size",
    "noPreview": "Preview is not available for this file."
  },
  "help": {
    "click": "select file or directory",
    "ctrl": {
      "click": "select multiple files or directories",
      "f": "opens search",
      "s": "save a file or download the directory where you are"
    },
    "del": "delete selected items",
    "doubleClick": "open a file or directory",
    "esc": "clear selection and/or close the prompt",
    "f1": "this information",
    "f2": "rename file",
    "help": "Help"
  },
  "languages": {
    "he": "עברית",
    "hu": "Magyar",
    "ar": "العربية",
    "de": "Deutsch",
    "el": "Ελληνικά",
    "en": "English",
    "es": "Español",
    "fr": "Français",
    "is": "Icelandic",
    "it": "Italiano",
    "ja": "日本語",
    "ko": "한국어",
    "nlBE": "Dutch (Belgium)",
    "pl": "Polski",
    "pt": "Português",
    "ptBR": "Português (Brasil)",
    "ro": "Romanian",
    "ru": "Русский",
    "sk": "Slovenčina",
    "svSE": "Swedish (Sweden)",
    "tr": "Türkçe",
    "ua": "Українська",
    "zhCN": "中文 (简体)",
    "zhTW": "中文 (繁體)"
  },
  "login": {
    "createAnAccount": "Create an account",
    "loginInstead": "Already have an account",
    "password": "Password",
    "passwordConfirm": "Password Confirmation",
    "passwordsDontMatch": "Passwords don't match",
    "signup": "Signup",
    "submit": "Login",
    "username": "Username",
    "usernameTaken": "Username already taken",
    "wrongCredentials": "Wrong credentials"
  },
  "permanent": "Permanent",
  "prompts": {
    "copy": "Copy",
    "copyMessage": "Choose the location to copy your files to:",
    "currentlyNavigating": "Currently navigating on:",
    "deleteMessageMultiple": "Are you sure you wish to delete {count} file(s)?",
    "deleteMessageSingle": "Are you sure you wish to delete this file/folder?",
    "deleteMessageShare": "Are you sure you wish to stop this sharing ({path})?",
    "deleteTitle": "Delete files",
    "displayName": "Display Name:",
    "download": "Download files",
    "downloadMessage": "Choose the format you wish to download.",
    "error": "Something went wrong",
    "fileInfo": "File information",
    "filesSelected": "{count} files selected.",
    "lastModified": "Last Modified",
    "move": "Move",
    "moveMessage": "Choose new home for your file(s)/folder(s):",
    "newArchetype": "Create a new post based on an archetype. Your file will be created on content folder.",
    "newDir": "New directory",
    "newDirMessage": "Name your new directory.",
    "newFile": "New file",
    "newFileMessage": "Name your new file.",
    "numberDirs": "Number of directories",
    "numberFiles": "Number of files",
    "rename": "Rename",
    "renameMessage": "Insert a new name for",
    "replace": "Replace",
    "replaceMessage": "One of the files you're trying to upload has a conflicting name. Do you wish to skip this file and continue to upload or replace the existing one?\n",
    "schedule": "Schedule",
    "scheduleMessage": "Pick a date and time to schedule the publication of this post.",
    "show": "Show",
    "size": "Size",
    "upload": "Upload",
    "uploadFiles": "Uploading {files} files...",
    "uploadMessage": "Select an option to upload.",
    "optionalPassword": "Optional password",
    "resolution": "Resolution",
    "discardEditorChanges": "Are you sure you wish to discard the changes you've made?"
  },
  "search": {
    "images": "Images",
    "music": "Music",
    "pdf": "PDF",
    "pressToSearch": "Press enter to search...",
    "search": "Search...",
    "typeToSearch": "Type to search...",
    "types": "Types",
    "video": "Video"
  },
  "settings": {
    "admin": "Admin",
    "administrator": "Administrator",
    "allowCommands": "Execute commands",
    "allowEdit": "Edit, rename and delete files or directories",
    "allowNew": "Create new files and directories",
    "allowPublish": "Publish new posts and pages",
    "allowSignup": "Allow users to signup",
    "avoidChanges": "(leave blank to avoid changes)",
    "branding": "Branding",
    "brandingDirectoryPath": "Branding directory path",
    "brandingHelp": "You can customize how your File Browser instance looks and feels by changing its name, replacing the logo, adding custom styles and even disable external links to GitHub.\nFor more information about custom branding, please check out the {0}.",
    "changePassword": "Change Password",
    "commandRunner": "Command runner",
    "commandRunnerHelp": "Here you can set commands that are executed in the named events. You must write one per line. The environment variables {0} and {1} will be available, being {0} relative to {1}. For more information about this feature and the available environment variables, please read the {2}.",
    "commandsUpdated": "Commands updated!",
    "createUserDir": "Auto create user home dir while adding new user",
    "tusUploads": "Chunked Uploads",
    "tusUploadsHelp": "File Browser supports chunked file uploads, allowing for the creation of efficient, reliable, resumable and chunked file uploads even on unreliable networks.",
    "tusUploadsChunkSize": "Indicates to maximum size of a request (direct uploads will be used for smaller uploads). You may input a plain integer denoting byte size input or a string like 10MB, 1GB etc.",
    "tusUploadsRetryCount": "Number of retries to perform if a chunk fails to upload.",
    "userHomeBasePath": "Base path for user home directories",
    "userScopeGenerationPlaceholder": "The scope will be auto generated",
    "createUserHomeDirectory": "Create user home directory",
    "customStylesheet": "Custom Stylesheet",
    "defaultUserDescription": "These are the default settings for new users.",
    "disableExternalLinks": "Disable external links (except documentation)",
    "disableUsedDiskPercentage": "Disable used disk percentage graph",
    "documentation": "documentation",
    "examples": "Examples",
    "executeOnShell": "Execute on shell",
    "executeOnShellDescription": "By default, File Browser executes the commands by calling their binaries directly. If you wish to run them on a shell instead (such as Bash or PowerShell), you can define it here with the required arguments and flags. If set, the command you execute will be appended as an argument. This applies to both user commands and event hooks.",
    "globalRules": "This is a global set of allow and disallow rules. They apply to every user. You can define specific rules on each user's settings to override these ones.",
    "globalSettings": "Global Settings",
    "hideDotfiles": "Hide dotfiles",
    "insertPath": "Insert the path",
    "insertRegex": "Insert regex expression",
    "instanceName": "Instance name",
    "language": "Language",
    "lockPassword": "Prevent the user from changing the password",
    "newPassword": "Your new password",
    "newPasswordConfirm": "Confirm your new password",
    "newUser": "New User",
    "password": "Password",
    "passwordUpdated": "Password updated!",
    "path": "Path",
    "perm": {
      "create": "Create files and directories",
      "delete": "Delete files and directories",
      "download": "Download",
      "execute": "Execute commands",
      "modify": "Edit files",
      "rename": "Rename or move files and directories",
      "share": "Share files"
    },
    "permissions": "Permissions",
    "permissionsHelp": "You can set the user to be an administrator or choose the permissions individually. If you select \"Administrator\", all of the other options will be automatically checked. The management of users remains a privilege of an administrator.\n",
    "profileSettings": "Profile Settings",
    "ruleExample1": "prevents the access to any dotfile (such as .git, .gitignore) in every folder.\n",
    "ruleExample2": "blocks the access to the file named Caddyfile on the root of the scope.",
    "rules": "Rules",
    "rulesHelp": "Here you can define a set of allow and disallow rules for this specific user. The blocked files won't show up in the listings and they wont be accessible to the user. We support regex and paths relative to the users scope.\n",
    "scope": "Scope",
    "setDateFormat": "Set exact date format",
    "settingsUpdated": "Settings updated!",
    "shareDuration": "Share Duration",
    "shareManagement": "Share Management",
    "shareDeleted": "Share deleted!",
    "singleClick": "Use single clicks to open files and directories",
    "themes": {
      "dark": "Dark",
      "light": "Light",
      "title": "Theme"
    },
    "user": "User",
    "userCommands": "Commands",
    "userCommandsHelp": "A space separated list with the available commands for this user. Example:\n",
    "userCreated": "User created!",
    "userDefaults": "User default settings",
    "userDeleted": "User deleted!",
    "userManagement": "User Management",
    "userUpdated": "User updated!",
    "username": "Username",
    "users": "Users"
  },
  "sidebar": {
    "help": "Help",
    "hugoNew": "Hugo New",
    "login": "Login",
    "logout": "Logout",
    "myFiles": "My files",
    "newFile": "New file",
    "newFolder": "New folder",
    "preview": "Preview",
    "settings": "Settings",
    "signup": "Signup",
    "siteSettings": "Site Settings"
  },
  "success": {
    "linkCopied": "Link copied!"
  },
  "time": {
    "days": "Days",
    "hours": "Hours",
    "minutes": "Minutes",
    "seconds": "Seconds",
    "unit": "Time Unit"
  }
}
