{
  "repeater": {
    "repeater": "PDJ Media Repeater",
    "nameRepeater": "REPEATER",
    "playFavoriteList": "Play Favorite List",
    "fav": "Favorite",
    "settings": "Settings",
    "switchsubtitleLanguages": "Switch Subtitle",
    "subTools": "Subtitle Batch Processing Tool",
    "editSubandNote": "Edit subtitle",
    "singleSentenceRepetitionMode": "Single Sentence Repetition Mode",
    "regularMode": "Regular Mode",
    "note1": "Please use standard browser - Edge, Chrome, Safari or Firefox to ensure PDJ Media Repeater can work correctly.",
    "note2": "For Android Phone in China, please use Official",
    "note3": "Other browsers may not support uttering translation lines with system TTS(will auto switch to online TTS service), or may hijack video or audio tag to make PDJ media repeater losing control of the media file.",
    "publicConfig": "Use Public Configuration",
    "addPrivate": "Generate a Private Configuration for this subtitle file ", 
    "privateConfig": "Use this subtitle file's Private Configuration",
    "sentencePlaybackTimes": "Sentence Playback Times:",
    "interval": "Interval (in second):",
    "timestampMove": "Move of StartTime for all subtitles (in ms):",
    "timestampMoveEnd": "Move of EndTime for all subtitles (in ms):",  
    "speedEachTime": "speeds for each repetition (default:1):",
    "tempSpeed": "Show Temporary Playback Speed Toggle - This button allows for convenient real-time temporary adjustment of playback speed. All subsequent repeats will play using this temporary speed.",
    "switchTempSpeed": "Temporary Playback Speed Toggle",
    "showRetracePlay1": "Display the 'Rewind Play' button that rewinds playback by ",
    "showRetracePlay2": " seconds with each click (But will not go back beyond the start time of the current sentence).",
    "retracePlay": "Rewind {rT} seconds and replay",
    "showArrow": "Display Switch Sentence Buttons on PC browser.",
    "allowVideoFullScreen": "Play the video as a full screen background in landscape mode, except for 'edit' and 'dictation and shadowing recording mode'.",
    "isCustomFont": "Customize Subtitle Style (css)",
    "firstLine": "Line 1: ",
    "secLine": "Line 2: ",
    "helpCss": "Please input CSS style, which can be designed with AI assistance. You can customize subtitles' position(margin-bottom), font, font size, color, line width, line spacing, shadow effects, and more. For example: font-family: Arial Narrow; font-size:1.5em; color: white; width: 80%; margin: 0.4em auto; margin-bottom: 0.5em; text-shadow: 2px 2px 2px #000; text-align: center;",
    "previous": "Previous Sentence",
    "next": "Next Sentence",
    "autoPlayCurrentSentence": "Auto Utter Current Content",
    "autoSwitchtoNextSentence": "Auto Switch to Next Sentence (Disabled in edit mode.)",    
    "utterSubtitle": "Utter Subtitle's Translation Line with TTS",
    "autoDetect": "auto-detect",
    "alertAutoDetect": "'Language Used In translation Line' will be set as the Current browser 's language; The Line Number Of Translation In Subtitle' will be determined based on whether the language of the current sentence's first line of the subtitle (detected by alibaba api service) is the same as the language used by the browser.",
    "systemTTS": "Use System Built-In TTS",
    "SystemTTSnote": "Simple, Fast and Steady",
    "notSystemTTS": "Use Online TTS Service",
    "testUrl": "Test",
    "notSystemTTSnote": "The default TTS API address maybe invalid. You can change it to any other online TTS API with interface 'get' or azure Speech Service (Test it firstly). e.g.: http://api.voicerss.org/?key={key1}&hl=zh-cn&c=MP3&v=Wang&r=0&f=16khz_16bit_stereo&src=  Or azure-tts:defaultkey1,eastasia,zh-CN-YunyiMultilingualNeural",
    "ttsDetails" : "INSTRUCTIONS",
    "TTSSetting": "If the uttering fails, it may be due to incorrect TTS API parameters or excessive call frequency. When using voiceRSS, the daily call limit is 350 times. 'c3c059ecf47e489c8db0d038867e75c1' can be replaced with '66e82191c8df46dc8e03e217ae557f91'. Users can also apply for a free account (email required) and replace the key value in the address; When using Azure TTS, you can replace 'defaultkey1,eastasia' with 'defaultkey2,eastus' or 'defaultkey3,southeastasia'. These three Azure default settings are for testing only, please do not use them for a long time to avoid exceeding the monthly free quota! Users can also apply for a free Azure account and subscribe Voice Service in Azure AI service. (F0 is free services with 1 millions chars limit, it will be charged beyond this limit.) And replace 'defaultkey1,eastasia' with the 'subscription key,region value' of your own account. For example: azure-tts:d5da5b312758xxxxxxxxxxxxxxxxxxxxxx,eastasia,zh-CN-YunyiMultilingualNeural.  'zh-CN-YunyiMultilingualNeural' can be replaced with other speakers supported in the region, which can be queried here using a computer browser: https://learn.microsoft.com/en-us/azure/ai-services/speech-service/language-support?tabs=tts#text-to-speech, for example: 'en-US-AriaNeural', 'zh-CN-XiaoshuangNeural'.",
    "ttsWrong": "Error uttering content using online TTS!",
    "langInTransLine": "Language Used In translation Line:",
    "lineNumOfTrans": "Line Number Of Translation In Subtitle:",
    "testTTSVoice": "Voice Test",
    "voice": "Voice (Your browser has {totalvoices} voices for this language, including online voices):",
    "pauseTime": "Pause Time (in second):",    
    "speedOfUttering": "Speed Of Uttering:",
    "nextLoopPlay": "Loop Play in Range:",
    "random":"Random Play",	 
    "autoStop": "AutoStop After the Last Click: ",	  
    "replayFromStart": "SingleClick to Replay Current Sentence from the First Time",
    "utterTransFirstly": "Utter Subtitle's Translation Line Firstly",
    "autoPauseAfterFirstDone": "AutoPause After Uttering Translation Line or Playing Current Sentence Firstly, And Click To Continue.(Disabled in edit mode.)",
    "dubbingMode": "When playing in Regular Mode, enable the dubbing function (simultaneously playing media and reading translations using TTS, you can manually adjusting the media volume).",
    "playFullFavList": "Play All Favorite Sentenses in Current User's Root Folder When Playing Favorite List (In this mode, autoPlay current sentence is not allowed due to browser's restriction.)",
    "autoCloseCheck": "Turn off 'Dictation Check' automatically when switching sentences in Dictation and Shadowing Recording mode.",
    "ignoreC": "Ignore capitalization and punctuation at the end of words when 'Dictation Check' in Dictation and Shadowing Recording mode.",
    "wavesurfer": "Enable Visual waveform chart by default in editing mode in a non-mobile browser . Click ",
    "wavesurfer2": " to switch. Note: When turning on this visual waveform chart in a mobile browser mannually, if the media file is too large, the browser may crash. You can clear up the browser's caches on the login page and try again, or visit it in a computer browser first. After successfully loading the visualization waveform for the first time, the system will automatically save the peak data of this media file to current user's /!PDJ/peaks folder on the server, this media file will no longer cause browser crashes in the future. (If the waveform cannot be displayed for a long time, it may be due to the media file being too large or insufficient browser cache space.)",    
    "transUrl": "New Word Explanation Url:",
    "transUrlNote": "eg. https://fanyi.baidu.com/#auto/auto/, https://www.baidu.com/s?wd=, https://translate.sogou.com/text?keyword=, https://cn.bing.com/translator?ref=TThis&from=&to=cn&text=, https://www.deepl.com/en/translator#en/zh-hans/, https://m.iciba.com/word?w=",
    "allowCache": "Cache Media - Enable to Save Visited Media Files in Browser's Cache. This will hugely save traffic usage in the next visit, but will take up storage space on this device (This setting's default value is true, and will only be saved in current browser cache after being changed). In 'Offline APP Mode', 'Cache Media' will be automatically selected.",
    "cached1": "Max number of latest files to cache:",
    "savedfiles": "Number of media files saved in this Browser's Cache: {numOfKeys}",
    "cleanUpCache": "Clean UP",
    "allowOfflineL": "Offline APP Mode",
    "offlineApp": "Offline APP mode - Please change this setting on the login page. The offline APP mode can be used normally with or without network, and will prioritize the use of files in the browser cache.  When there is no network (client cannot connect to the network or server is turned off), uncached files will not be displayed. In this mode, editing subtitles and settings can still be performed. All changes will be stored in the browser cache and will not be saved to the server, and can be updated to the server with your permission after turning off this mode (If there are important modifications, do not forget to switch to non offline APP mode in a timely manner to synchronize to the server). Offline APP mode will automatically log in with the account information in the cache. The non offline APP mode can only be used online and will update the server content to the browser cache (the resources in the 'media cache' are stored in a dedicated database and are not controlled by this). In non offline APP mode, all modifications will be automatically saved to the browser cache and updated in real-time to the server.",
    "saveUnsavedSub": "Note: The modified subtitle file in the browser cache has not been synchronized to the server yet. Clicking 'OK' will upload it to the server and will automatically backup the original .srt file on the server; Clicking 'Cancel' will use the subtitle file from the server and update the cache.",
    "saveUnsavedFav": "Note: The modified config file {favFileName} in the browser cache has not been synchronized to the server yet. Clicking 'OK' will upload it to the server; Clicking 'Cancel' will use the config file from the server and update the cache.",    
    "wrongSrt": "Incorrect SRT file format! 1. SRT files require UTF-8 encoding! You can save the file as UTF-8 encoding using Notepad or other text editors. 2. Use a blank SRT file instead, and then edit and add subtitles yourself. Click 'OK' to close this page.",
    "addnewWord": "Add a New Word or Phrase",
    "instructions": "INSTRUCTIONS",
    "instruction1": "Click (DOWN arrow key on keyboard): replay current sentence",  
    "instruction2": "DoubleClick (UP arrow key or Alt key on keyboard): stop playing",
    "instruction3": "Swipe Left or RIGHT arrow key on keyboard or button",
    "instruction31": ": jump to next sentence",
    "instruction4": "Swipe Right or LEFT arrow key on keyboard or button",     
    "instruction41": ": jump to previous sentence",
    "instruction50": "In the subtitle area, swipe slowly or double-click with the mouse, long press with the finger: select text to quickly add new words and phrases", 
    "instruction5": "Swipe Up: add to favorites (Or remove a favorite when playing Favorite List)",
    "instruction6": "Swipe Down: stop playing",
    "clickButton": "Click button",
    "clickButton1": "On the edit page, click button",
    "instruction13101": ": Redo or Undo. Note: The favorite status of deleted or merged sentences may not be restored correctly. Please adjust it manually.",
    "instruction14": ": Review",     
    "instruction7": ": switch Playback Mode among 'Single Sentence Repetition Mode', 'Dictation and Shadowing Recording Mode' and 'Regular Mode'. These icons in red indicate the media file stored in the browser cache is being played (No consumption of Internet traffic).",
    "clickButton2": "In page 'Dictation and Shadowing Recording Mode', click button",
    "instruction71": ": Dictation Check; shadowing recording; play record",  
    "instruction8": ": switch Subtitle in 8 Modes",
    "or": "or",
    "instruction9": ": show SETTINGS, INSTRUCTIONS, UPDATES and COMMENTS",         
    "instruction10": ": play sentences in favorite List", 
    "instruction13": ": edit subtitle, annotation and timestamp, add or remove a new word or phrase.", 
    "instruction131": ": automatically translating subtitles, timestamp shifting, and subtitle formating",
    "instruction11": ": add or remove a favorite sentence.", 
    "clickandInput": "Click",
    "clickandInput1": "On the subtitle list page, click",  
    "instruction12": ": show Subtitle List, New Words Test or New Words List. Click the item in the list to switch Current Sentence.",                 	    
    "instruction121": ": Switch between the 'search' mode and the 'search-and-replace' mode",
    "instruction122": ": 'Case Matching' Toggle",
    "instruction18": "Click the button ",  
    "instruction118": " located on the sidebar: Batch conversion of subtitle formats, supporting mutual conversion between SRT, LRC, ASS, and VTT subtitle formats. PDJ Media Repeater only supports SRT subtitles encoded in UTF-8. If SRT subtitles display garbled text when opened, this tool can also be used to fix it.",
    "learnLangUsingPDJ": "To Learn A Language Using PDJ Media Repeater",
    "learnLang1": "There are two very effective methods to learn a language: Shadowing and Reciting. For shadowing, you need listen to a sentence firstly, and then repeat it yourself immediately (maybe in mind). For reciting, you need read or listen to a sentence in your mother language firstly, and then translate to the new language immediately.",
    "learnLang2": "The key to the success of these two methods lies in REPETITION, a large amount of REPETITION, until permanent conditioned reflexes similar to muscle memories like swimming are formed! For the same sentence, you need to repeat shadowing and reciting it again and again (maybe 100 times in a year) to make it as familiar as your mother language. This is a boring and time-consuming job with no obvious effects in short time.",
    "learnLang3": "With PDJ Media Repeater, you can do shadowing and reciting easier, and the 'Review' function will ensure that you can obtain efficient and sufficient repetition times. Just choose a video or audio with 20-50 sentences every week, and repeat shadowing and reciting them every morning and evening 2 or 3 times. You can lie in your bed, close your eyes, and click, or swipe left, up in your cell phone to learn the language. Thus, in one year, you may master thousands of sentences as fluent as your mother language. That will be a big improvement.If you repeatedly listen carefully to 50 sentences(or more) from American TV series every week (you can start by listening at 0.7-0.8 speed, it's much easier to understand), after practicing 10 to 20 episodes, you will notice very obvious progress.",        
    "dictation": "Dictation and Shadowing Recording Mode",
    "dictationCheck": "Dictation Check",
    "recording": "Shadowing Recording",
    "cannotRecording": "Recording unavailable. Microphone access permission denied.",
    "uploadDicRec": "Upload Dictation & Shadowing Recordings to Server",
    "downloadDicRec": "Download Dictation & Shadowing Recordings from Server to Browser Cache",
    "confirmUploadDictation2": "Comfirm upload of ALL dictation/shadowing recordings of this media file from browser cache to server's folder {recordingDir} (For sharing with other browsers)? If these contents do not exist in the browser cache, the dictation content and shadowing recording on the server will be automatically cleared.",
    "confirmDownloadDictation2": "Confirm download of this media file's dictation/shadowing recordings from server to browser cache? If these contents do not exist on the server, the browser cache will be automatically cleared of dictation content and shadowing recordings.",
    "clearAllDicRec": "Delete All Dictation & Shadowing Recordings",
    "failDownload":  "Download failed. Please check network connection.",
    "failUpload": "failed! Check network and ensure this user has write/delete permissions.",
    "confirmdeleteDicRec": "Permanently delete ALL dictation/shadowing recordings of this media file from both browser cache and server? Dictation file on the server: {dictationFile}, Shadowing recordings dir on the server: {recordDir}",
    "noRecordPermission": "Failed to obtain microphone permission! A microphone needs to be connected and a secure context is required. a. If no microphone is connected, please connect a physical microphone, refresh the webpage, and try again. b. Please ensure a secure context is available: Websites starting with 'http://' cannot access system microphones. Solutions: 1. Use the browser on the server and access via IP '127.0.0.1:PORT'. 2. For EDGE/Chrome in Windows/Mac system: visit chrome://flags/#unsafely-treat-insecure-origin-as-secure in address bar, then add this site's URL (with http:// and port, for example: http://xxx.com:8080), choose 'Enable' on the right side, and then restart the browser! (All Browsers for IOS currently do not support this setting.)  3. Apply for 'https://' certification (a little bit complex) to enable microphone access universally.",
    "noRecordFound": "Microphone not found.",
    "playRecording": "Play recording",
    "dictationDefault": "Type what you hear here...",
    "dictationDefault1": "Dictation Content can't be saved while playing Fav List.",
    "updatesandComments": "UPDATES、COMMENTS and Resource Sharing",
    "github": "Project on Github:",
    "youdao": "FAQ - YouDao Notes:",
    "baiduyun": "Resource Sharing:",
    "resetTTSurl": "RESET to default URL",
    "revise": "REVIEW",
    "revise1": "Current Learning",    
    "revise2": "Review Date (day): ",
    "revise3": "Add to Review Plan",          
    "revise4": "Sentence:",
    "delThisRevision": "Delete this Review",    
    "delThisRevision2": "Are you sure to delete this review?",
    "removeRevisionConfirm": "Unable to connect to the network, or the media file and subtitle file for this review have been moved or deleted on the server! Clicking 'OK' will delete this review item. If necessary, please manually add again; Or click 'Cancel' to close and try again after connecting to the internet or in 'Offline APP Mode'.",  
    "revise5": "Marked as 'Reviewed'",
    "revise55": "Marked as 'Haven't Reviewed'",
    "confirmDelete": "Are you sure to delete Current Sentence? (On a PC browser, using the shortcut 'Alt + Del' allows for direct execution without this confirmation.)",
    "infoDeleteWord": "Delete New Word or Phrase",
    "confirmDeleteWord": "Are you sure to delete current New Word or Phrase?",
    "confirmMerge": "Are you sure to merge Current Sentence to Next Sentence? (On a PC browser, using the shortcut 'Ctrl + Alt' + click in the sentence region of the waveform allows for direct execution without this confirmation.)",
    "confirmAdd": "Are you sure to add a New Sentence after Current Sentence? (On the computer browser, press and hold the Alt key, then drag the mouse in the blank area of the waveform timeline to select an area, and click on this area to add it as a new sentence.)",
    "confirmSplit": "Are you sure to split Current Sentence? (On a PC browser, using the shortcut 'Alt' + click in the sentence region of the waveform allows for direct execution without this confirmation. And it can be precisely split at the click point)",    
    "showWaveSurfer": "turn on/off Visual Waveform Chart", 
    "infoDelete": "Delete Current Sentence",
    "infoMerge": "Merge Current Sentence to Next Sentence",
    "infoAdd": "Add a New Sentence after Current Sentence",
    "infoSplit": "Split Current Sentence", 
    "translator0": "Subtitle translation engine:",
    "translator00": "help",
    "translator1": "Translate ",
    "translator10": "to ",
    "translator100": "sentences' line",    
    "translator2": "to",
    "translator3": ", and save to line {targetLine}.",
    "alertTranslatorUrl": "The original contents of line {targetLine} will be cleared and can be restored by the undo button; the subtitle translation engine can be changed in 'Settings', including Alibaba Cloud machine translation engine (default) and Microsoft Azure AI service-translator. Alibaba Cloud Machine Translation Language Code: https://help.aliyun.com/zh/machine-translation/developer-reference/machine-translation-language-code-list?spm=a2c4g.11186623.0.i1; Microsoft Azure language code: https://learn.microsoft.com/en-us/azure/ai-services/translator/language-support, or https://learn.microsoft.com/zh-cn/azure/ai-services/translator/language-support",        
    "alertTranslatorUrl1": "This subtitle translation function uses Alibaba Cloud machine translation engine by default and comes with a default setting (ali-translator:default). The default settings are for testing purposes only, please do not use them in large quantities to avoid exceeding the monthly free limit. Users can also apply for an Alibaba Cloud account and activate machine translation services (After real name authentication, the General editions has a monthly free quota of 1 million characters, and billing will begin after exceeding the limit). Then input with format: ali-translator:AccessKey ID,AccessKey Secret. The subtitle translation function can also use Microsoft Azure's translation service. Users can apply for a free Azure account, and subscribe the Translator free (F0) service (region: global) under Azure AI service (monthly free limit is 1 million characters, excess amount will be charged, users can set up an excess reminder on Azure official website). Then input with format: azure-translator:subscription-Key,global,endpoint. For example: azure-translator:d5da5b312758xxxxxxxxxxxxxxxx,global, https://api.cognitive.microsofttranslator.com/ ",
    "slowInternet": "Slow Internet or Media Source switched! Replay...",
    "undo": "Undo",
    "redo": "Redo",
    "subTranscribe00": "Use the browser's built-in free API",
    "subTranscribe01": "Use Azure Speech Service API",
    "subconvertor00": "Select Folders on the Server (The user needs to have write permissions to the server.)",
    "subconvertor01": "Select Folders on Local System",    
    "subconvertor1": "Batch Subtitle Format Converter",
    "subconvertor2": "Supports batch conversion between SRT, LRC, ASS, and VTT subtitle files, with encoding specification. Note: PDJ Media Repeater only supports SRT subtitles in UTF-8 encoding, which is the default output format.",
    "subconvertor3": "Select the directory containing original subtitle files (e.g., LRC, ASS, VTT, SRT.)",
    "subconvertor4": "Input Directory",
    "subconvertor5": "Browse",
    "subconvertor6": "Output Directory",
    "subconvertor7": "Select save directory for new subtitle files",
    "subconvertor8": "When saving, existing files with the same name will be overwritten.",
    "subconvertor9": "OPTIONS",
    "subconvertor10": "Split Character(s)",
    "subconvertor11": "Enter character(s) for splitting subtitles (e.g., ^ or ,)",
    "subconvertor12": "Each subtitle line will be split into two lines using this character(s). Leave blank to disable splitting.",
    "subconvertor13": "Source Subtitle Encoding",
    "subconvertor14": "such as utf-8, gbk, etc. Leave it blank for automatic detection.",
    "subconvertor15": "If some subtitles contain garbled text, manually specify source encoding and re-convert.",
    "subconvertor161": "Find and Replace: ",
    "subconvertor16": "Original String",
    "subconvertor17": "Target String",
    "subconvertor18": "Auto-format English Subtitles: Capitalize first letter and add period at the end of each sentence.",
    "subconvertor19": "Output Subtitle Format: ",
    "subconvertor20": "Output Subtitle Encoding: ",
    "subconvertor21": "Files to Convert",
    "subconvertor22": "Please select input directory to view file list",
    "subconvertor23": "Total found",
    "subconvertor24": "files:",
    "subconvertor25": "Conversion Progress",
    "subconvertor26": "Conversion Result",
    "subconvertor27": "Converting...",
    "subconvertor28": "Start Batch Conversion",
    "subconvertor29": "PDJ Media Repeater - Batch Subtitle Format Converter | Recommend using Edge or Chrome browsers (Other browsers may not support the 'Select Folders on Local System' mode.)",
    "subconvertor30": "The current browser does not support obtaining batch write permissions for local folders. It needs secure context! Solutions: Use Chrome or Edge browsers, and 1. Access via 127.0.0.1:port number in Chrome or Edge browsers on the server side to obtain batch write permissions for local folders. 2. On non-mobile systems (such as Windows or Mac), Chrome or Edge allows users to customize security policies, visit chrome://flags/#unsafely-treat-insecure-origin-as-secure in the browser address bar, enter this website URL (starting with http:// and including the port number), select 'Enabled' on the right, and restart the browser to obtain batch write permissions for local folders. 3. Apply for an 'https://' certificate for the website (a little bit complex), then, Chrome and Edge browsers can obtain batch write permissions for local folders.",
    "subconvertor31": "Please select a input directory containing lrc, srt, ass, or vtt files first.",
    "subconvertor32": "Please select an output directory first.",
    "subconvertor33": "Conversion complete! Success: ",
    "subconvertor34": " files, Failed: ",
    "subconvertor35": " files.",
    "subconvertor36": "  conversion successful",
    "subconvertor37": "  conversion failed: ",
    "tsc01": "Check Current Sentence with AI",
    "tsc02": "Only supports the computer version of Edge and Chrome browsers, and requires a secure context.",
    "tsc03": "This function will call the browser's built-in SpeechRecognition interface, which is completely free and unlimited (Users can also use Edge or Chrome's built-in 'Live Caption' offline function to check subtitles directly, but the accuracy is not ideal). This interface is used to collect the speech input from the microphone and generate text synchronously. The PDJ media repeater will simulate the media sound as a microphone input signal for recognition. The computer can be connected to an actual microphone device (the recognition result may be affected by environmental noise, so try to keep the environment quiet). It can also enable 'stereo mixing' in the Windows system, and select 'stereo mixing' in control panel's 'system - audio - input'(double-check: the built-in 'Windows Voice Recorder' software in Windows can perform internal recording), in which case no actual microphone is needed (the recognition result  is not affected by environmental noise and is actually better. However, a secure context is still required). The browser needs to have a secure context to obtain the permission to use the microphone, which means the accessed website URL must start with 'https://', and websites starting with 'http://' cannot call the client microphone in the browser. Solutions: 1. Access via '127.0.0.1:port' in the browser on the server side to obtain microphone permissions. 2. On Windows and Mac systems, in the EDGE or Chrome browser, visit 'chrome://flags/#unsafely-treat-insecure-origin-as-secure' in the browser address bar, enter this website URL (starting with 'http://', ending the port number, such as 'http://xxx.com:8080'), select 'Enabled' on the right, and restart the browser to access the system microphone. 3. Apply for an 'https://' certificate for the website (more complex), and then any browser can obtain microphone permissions.",
    "tsc04": "Azure config:",
    "tsc05": "This function will call the Microsoft Azure Speech Service interface (Same as Azure TTS), with each account having a free monthly quota of 5 hours, and charges applying for usage exceeding this quota. The PDJ Media Repeater has three built-in accounts ('defaultkey1,eastasia', 'defaultkey2,eastus', 'defaultkey3,southeastasia'), which are for testing only (May become invalid). Please do not make a large number of calls to avoid exceeding the monthly free quota! Users can also apply for a free Azure account, which requires a Visa or Mastercard international credit card or a student email address. They need to enable the Speech Service under Azure AI Service (F0 tier; for long-term use, switch to a 'Pay as you go' account, which can still retain the F0 tier service with a free monthly quota of 5 hours), and replace 'defaultkey1,eastasia' with their own account's subscription-Key and region values, for example: 'd5da5b312758xxxxxxxxxxxxxxxx,eastasia'.",
    "tsc06": "Speed:",
    "tsc07": "If the media speaking speed is too fast, slowing it down appropriately can improve recognition accuracy.",
    "tsc08": "Line Num:",
    "tsc09": "Recognition language:",
    "tsc10": "Original Text",
    "tsc11": "Transcribed Text",
    "tsc12": "Check",
    "tsc13": "Play",
    "tsc14": "Save",
    "tsc15": "Use AI to check the current sentence's original text",
    "tsc16": "This browser does not support this function!",
    "tsc18": "Using a built-in Azure account, only for test use! Please replace it with a personal Azure account ASAP, or use the browser's built-in free API.",
    "tsc19": "Processing...",
    "tsc20": "Calling the Azure Speech Service. The sentence length cannot exceed 15 seconds. Please split the sentence and try again, or use the browser's built-in free API. If you wanna generate subtitles for media, please refer to the 'Media Transcription' in the sidebar of the list page.",
    "tsc21": "Audio extraction failed. Please completely restart the browser and try again, or switch to another browser.",
    "tsc22": "Recognition failed: Please check the Azure configuration and network connection!",
    "subpage1": "Subtitle Translation",
    "subpage2": "Timestamp Shift",
    "subpage3": "Subtitle Format",
    "subNote1": "Switch Subtitle Mode",
    "option1": "1. the First & Second Lines",
    "option2": "2. All Three Lines",
    "option3": "3. Only the First Line",
    "option4": "4. Only the Second Line",
    "option5": "5. Only the third Line",
    "option6": "6. the First & Third Lines",
    "option7": "7. the Second & Third Lines",
    "option8": "8. None",
    "toolsNote": "* New file will be saved in folder /!PDJ/user-{xx}/Repeater-backup under current user's root directory on the server.",
    "tool1": "  1.* Backup current .srt file to the server.",
    "tool2": "  2. Keep only the First Line of subtitles.",
    "tool3": "  3. Keep only the Second Line of subtitles.",
    "tool4": "  4. Keep only the First Line and Second Line of subtitles.",
    "tool5": "  5. Swap the First Line and the Second Line.",
    "tool6": "  6.* Generate a .txt plain text file without serial numbers and timestamps and save to the server.",
    "tool7": "  7.* Generate a .txt plain text file without timestamps and save to the server.",
    "tool8": "8.* Generate a. txt plain text file from the list of new words, phrases, and example sentences and save it to the server.",
    "tool9": "9.* Generate a. txt plain text file of the favorite sentences of current media and save it to the server.",
    "tool10": "10.* Generate a. txt plain text file of all favorite sentences of current user and save it to the server.",
    "timeNote": "Note: The above two parameters will only change the timestamps temporarily and will be not saved the real subtitle file. For the same sentence end time, some browsers may stop playing slightly earlier. You can adjust the above items to temporarily change the timestamps. Before adjusting the timestamps of sentences in the editing mode, it is recommended to set the above two parameters to zero to avoid confusion.",
    "speedNote": "Note: The playback speed in Regular Mode will be set to the first value.",
    "infoMoveAll": "Move Whole TimeStamps",
    "moveAllStamp01": "Move All StartTimes backward(-) or forward(+) by ",
    "moveAllStamp02": "Move All EndTimes backward(-) or forward(+) by ",
    "moveAllStamp3": "All timestamps enlarge/shrink by",
    "moveAllStamp4": "times.",
    "alertShrinkAll": "When generating SRT subtitles for media files using third-party software, the speaking speed in the media has a significant impact on the accuracy of text recognition. If there are errors in the text of the generated SRT subtitle file, you can try using the ffmpeg command line to convert the original media file into a slow-speed WAV file for recognition. Then use this tool to batch-adjust the timestamps of the generated SRT subtitle file to normal speaking speed. For details, please refer to the note1 section of the 'Media Transcription' in the navigation bar.",    "alertMoveAll": "If the interval between sentences is insufficient, it will be automatically adjusted proportionally; You can press the UNDO button to return to the state before modification.",
    "moveAllStamp1": "ms.",
    "newWordTest": "New Words and Phrases Test",
    "newWordList": "New Words and Phrases List",
    "noNewWord": "No New Words and Phrases Found",
    "newWordInstruction": "Instruction: Add a new word or phrase: add it with format [Original Text:Translation] in the sentence's line 3 (note line) in Edit Mode, or select a text and click the 'plus' sign button in the bottom right corner to add it as a new word or phrase. Delete a new word or phrase: simply delete [Original Text:Translation] in the note line.",
     "noNewFav": "No favorite sentences found for current media",
    "noNewFav1": "No favorite sentences found for current user.",    
    "cached": "Media Cached! Switching...",
    "showWaveformInfo": "Generating waveform... ",
    "showWaveformInfo2": "If it cause a mobile browser crash, please use a PC browser to generate it first.",
    "cleanCache": "Clean up specified browser cache.",
    "cleanCacheDone": "Selected caches have been cleaned up!",
    "alertSpace": "The remaining cache space for storing subtitles, configuration files, etc. in this browser is less than 200KB. Please clear the third cache item on the login page as soon as possible to avoid confusion in content reading. If necessary, you can first synchronize the unsaved subtitle files to the server in non Offline APP mode",
    "cleanAccount": "Clear the login info in browser cache. Then, login in 'Offline APP mode' will not be disabled.",
    "cleanMedia": "Clear cached media files and To Do List's attachments in the browser!",
    "cleanSrtandSettings": "Clear other files in browser cache, including subtitles, settings, To Do List and attachments that have been modified but may not have been synchronized to the server!",
    "cleanAlert": "Tip: Moving or deleting files on the server may make favorite sentences and review plans stored in the config file /!PDJ/user-X/PDJ-Repeater.txt on the server invalid! If necessary, please manually delete this file on the server, and re-add the favorite sentences and review plans.",
    "wrongSrc": "The Media of this favorate sentence loading failed! Can't find it in the Media Cache and on the server. Click 'OK' to automatically cancel the favorite status of this sentence. Or click 'cancel' to stop playing favorites list.",
    "noFavoriteFile": "Unable to read the user config file '{favFileName}' on the server! This file is used to save user settings, favorite sentences list, and revision plan. If you are logging in to the PDJ media repeater with this account for the first time, please click 'OK' and this config file will be automatically created; If the PDJ media repeater software on the server has been updated, please click 'Cancel' and refresh the page to update the browser cache, and then try again; If it is due to network issues, please login using 'Offline APP Mode'. The PDJ media repeater will automatically cache accessed data for offline use, which can be cleared on the login page. Meanwhile, when using the subtitle editing function in non Offline APP Mode, the original .srt file will be modified. If necessary, please make a backup in advance.", 
    "speechsynthesisAlert": "Sorry, your browser does not support standard 'speechSynthesis API', and it can't utter the subtitle's translation line with system embedded TTS, this setting is disabled automatically. It is recommended to use a standard browser. Android phone users in China are recommended to use the original Firefox browser, which can call the system's built-in TTS service on Android phones without Google Framework.",
    "warning1": "Video or audeo tag is hijacked by this browser. This browser may not fully comply with HTML5 standard. Please restart your browser to retry. Or change to a standard browser: Edge, Chrome, Safari or Firefox to ensure PDJ Media Repeater can work correctly.",    
    "warning2": "Loading media... ",
    "quota": "Quota Used: ",
    "quota2": " chars (may be delayed).",
    "alert001": "This month's usage has exceeded the Alibaba Cloud machine translation's free quota of the default account. Please change the 'Subtitle translation engine' in the setting page to another Alibaba Cloud account or Microsoft Azure account in the setting page.",
    "alert002": "Wrong subtitle translation engine setting! Or failed to read the setting, refresh the browser and try again!",
    "alert003": "Translation failed: Response error, please try again! Or exceeded the character limit. Using Alibaba Cloud machine translation, the Quota Limit each time is 5000 characters (Each punctuation, space, English letter is counted as a character). Please segment the sentence range and try again, or use Microsoft Azure translation service.",
    "alert004": " Translation failed: Wrong server response, please try again later.",
    "alert005": "Translation failed: Network request failed, please check network connection.",
    "alert007": "Translation failed: Please check network connection or 'subtitle translation engine' setting.",
    "alert008": "Failed to utter the translation line with TTS.",
    "alert009": "Unable to save the file to server.",
    "alert010": "Azure TTS setup error, or network error!",
    "alert011": "Please select a sentence from the list first.",
    "findReplace": "Search and Replace",
    "search": "Search",
    "singleReplace": "Replace in Current Sentence",
    "allReplace": "Replace All",
    "caseSensitive": "Search (Match Case)",
    "caseInSensitive": "Search (Ignore Case)",
    "switchCaseSensitive": "Switch 'Match Case' or 'Ignore Case'",
    "replaceWith": "Replace with"
  },
  "reminder": {
    "alertAutoDetect": "Automatic detection will automatically set the TTS language for the current page based on simple rules: When the first character on the page is in English, it is set to English; Otherwise, it will be set as the browser language.",
    "reminder": "PDJ Universal To Do List",
    "nameReminder": "ToDo LIST",
    "logout": "Logout",
    "addNew": "Add A New Task",
    "return": "return without saving",
    "upload": "Upload to server", 
    "isBackUp": "Automatically backup PDJ-ToDoList.txt to the folder /!PDJ/user-{xx}/ToDoList-attachments/backup when task content changes.",
    "tags": "Tags:",
    "tag": "Tags",
    "lastReviewedDate": "Last Done:",
    "remembered": "Remembered",
    "forgot": "Forgotten",
    "forgot1": "Marked as 'to do'. The start date for this Recitation task has been reset to today and will restart this Recitation from the first day.",
    "forgot2": "Marked as 'to do'. As a Important task, this Recitation task will continue to be reminded tomorrow until 'Remembered' is clicked.",
    "forgot3": "Marked as 'to do'",
    "remembered1": "Marked as 'done'",
    "fromFirstDay": "When clicking on 'forgotten' on the page of Recitation task, reset Today as the Recitation plan's start date and it will restart reciting from the first day. Otherwise, it will only be marked as 'To Do' (but if it is an important task, it will continue to be reminded the next day).",  
    "edit": "Edit current task",
    "delete": "Delete current task",
    "deleteConfirm": "Are you sure to Delete Current Task?",
    "frontSide": "FRONT",
    "backSide": "BACK",
    "dailyList": "Daily To Do List",
    "wholeList": "Whole List",
    "markedAll": "Mark all 'To Do' Tasks on current and previous dates as 'Done'",
    "switchStatus": "Switch Status",
    "submit": "Submit",
    "switchImportant": "Switch importance",
    "types": "Types:",
    "editTask": "Edit Current Task",
    "Regular Task": "Regular Task",
    "Recitation Task": "Recitation Task",
    "Memo": "Memo",
    "specials": "Others:",
    "important1": "Important Task: will be displayed in the Daily To Do List (in red) even if it's out of date but hasn't been done.",
    "important": " Important Task",
    "important2": "Important Task: will be displayed in the Whole List in red color.",
    "With Attachments": "Task with Attachments",  
    "front": "Front Side of the Task Card",
    "back": "Back Side of the Task Card",
    "repDate": "Repitation Dates",
    "every": "every",
    "custom": "Custom Dates",
    "once": "Once",
    "startDate": "Start Date of the Task:",
    "endDate": "End Date of the Task:",
    "neverEnd": "Forever",
    "comingDate": "Doublecheck the latest 4 coming Repitation Dates:",
    "execTime": "Execution Time:",
    "attach": "Attachment",
    "attachVoice": "Attachment-voice",
    "mon": "Monday",
    "tue": "Tuesday",
    "wed": "Wednesday",
    "thu": "Thursday",
    "fri": "Friday",
    "sat": "Saturday",
    "sun": "Sunday",
    "ebbinghaus": "Ebbinghaus Forgetting Curve",
    "days": "Num of Days from Start Date:",
    "none": "none",
    "outOfDate": "OutOfDate",
    "utter": "Read Task's Content using TTS",
    "langinfrontside": "Language in Task Card's Front Side:",
    "speedOfUttering": "Speed Of Uttering:",
    "langInbackside": "Language in Task Card's Back Side:",
    "frontWithLang": "TTS API for Front Side",
    "backWithLang": "TTS API for Back Side",
    "noContent": "No content!",
    "unmatch": "The PDJ-ToDoList.txt file on the server has been modified by another client. Click 'OK' to update the browser cache based on the server content. Click 'Cancel' to continue to use the cached content in this browser and save it to the server.",
    "leaveWithoutSave": "Return without Saving?",
    "alert1": "Front Page of the Task Card can't be empty!",
    "alert2": "Selected day of week can't be empty!",
    "alert3": "Date for Ebbinghaus Forgetting Curve can't be empty!",
    "alert4": "Date for Custom Dates can't be empty!",
    "alert5": "End Date should not be smaller than Start Date.",
    "attachChanged": "The attachments have been changed and saved. Cannot exit without saving. Please click the save button to exit the editing mode.",
    "offlineApp": "Offline APP mode - This mode can be used normally with or without a network: When there is a network, files in the browser cache will be prioritized for use. If there are no required files in the cache, they will be downloaded from the server and stored in the browser cache; This mode can also be used normally when there is no network (client cannot connect to the network or server is turned off), but only cached files can be used, and uncached files will not be displayed. This mode can still perform adding or editing Tasks, attachments when there is no network, and it will automatically update to the server after connecting to the server. When this mode is turned off, regardless of whether it is connected to the internet or whether there is a cache of the required files in the browser, an update cache request will be sent to the server. If it is not connected to the internet, an error page will be displayed.This mode will automatically log in using the cached account information. Please change this mode on the login page.",
    "noTodoListFile": "Unable to read the user config file '{favFileName}' on the server! If this account is using the PDJ Universal To Do List for the first time, please click 'OK' and this config file will be automatically created; If the PDJ media repeater software on the server has been updated, please click 'Cancel' and refresh the page to update the browser cache, and then try again; If it is due to network issues, please login using 'Offline APP Mode'. The PDJ Universal To Do List will automatically cache accessed data for offline use, which can be cleared on the login page.", 
    "uploadUnsaved": " There are task contents and attachments that have been modified but not synchronized to the server. Clicking 'OK' will attempt to synchronize to the server. If you want to abandon these modifications, please click 'Cancel' and clear all caches after logging out, and Re-login while connected to the server to rebuild the browser cache from the server.",
    "status01": "To Do",
    "status02": "Done",
    "status03": "Not Due",  
    "ins01": "Welcome to Use PDJ Universal To Do List!", 
    "ins02": "Click",
    "ins03": " to add a new task.",  
    "ins04": "1. Select the Task Types, including Regular Task, Recitation Task, and Memo.",  
    "ins05": "2. Input contents of the Front Side and Back Side of the Task Card, and upload attachments (No limit to the size of each attachment, but attachments larger than 300 MB will not be cached in the browser and cannot be visited without network).",  
    "ins06": "3. Input tags (seperate with ';').",  
    "ins07": "4. Input Repitation Dates (Memo Task doesn't have Repitaion Dates). The PDJ Universal To Do List provides many Types of repitation dates.",  
    "ins08": "5. Input Task's Start Date, End Date and Execution Time. Then click the Save button to show it in the list.",  
    "ins09": "In the listing Page, click",  
    "ins10": " to switch between 'Daily To Do List' and 'Whole List'.",  
    "ins11": "1. The search box at the top of the list page can be used to search for task content. Click on the ",  
    "ins12": "can quickly search for task types and tags.",  
    "ins13": "2. In the Daily To Do List, you can click on ",  
    "ins14": " to change the task status.",  
    "ins15": "3. Memo tasks will not be displayed in the Daily To Do List.",  
    "ins16": "4. Clicking on each item in the list will take you to the Task Details page.",  
    "ins17": "On the Task Details page, you can browse each task and perform editing and deleting operations.",  
    "ins18": "1. Swipe left or right to switch tasks.",
    "ins19": "2. Swipe up and down to switch between the Front and Back Side of the Task Card.",   
    "ins20": "3. Single click on the page to read the content of the task card using TTS. Click on the attachment to display its contents.",  
    "ins21": "4. Double click on the page to enter the Task Editing page.",  
    "ins22": "Remarks:",    
    "ins23": "The PDJ Universal To Do List can be used both OnLine and OffLine (When using Offline, Offline APP Mode needs to be enabled on the Login page).",
    "ins24": "You can set the account language in the PDJ Media Repeater to change the display language of the PDJ Universal To Do List.",  
    "ins25": "You can back up the complete PDJ Universal To Do List by backing up the /!PDJ/user-{xx} folder on the server. All attachments are saved in /!PDJ/user-{xx}/ToDoList-attachments folder. And the PDJ Universal To Do List will automatically backup the file PDJ-ToDoList.txt to the folder /!PDJ/user-{xx}/ToDoList-attachments/backup after each task modification (Can be periodically deleted)." 
  },
  "buttons": {
    "cancel": "Cancel",
    "stop": "Stop",
    "close": "Close",
    "copy": "Copy",
    "copyFile": "Copy file",
    "copyToClipboard": "Copy to clipboard",
    "copyDownloadLinkToClipboard": "Copy download link to clipboard",
    "create": "Create",
    "delete": "Delete",
    "download": "Download",
    "file": "File",
    "folder": "Folder",
    "hideDotfiles": "Hide dotfiles",
    "info": "Info",
    "more": "More",
    "move": "Move",
    "moveFile": "Move file",
    "new": "New",
    "next": "Next",
    "ok": "OK",
    "permalink": "Get Permanent Link",
    "previous": "Previous",
    "publish": "Publish",
    "rename": "Rename",
    "replace": "Replace",
    "reportIssue": "Report Issue",
    "save": "Save",
    "schedule": "Schedule",
    "search": "Search",
    "select": "Select",
    "selectMultiple": "Select multiple",
    "share": "Share",
    "shell": "Toggle shell",
    "submit": "Submit",
    "switchView": "Switch view",
    "toggleSidebar": "Toggle sidebar",
    "update": "Update",
    "upload": "Upload",
    "openFile": "Open file",
    "continue": "Continue",
    "discardChanges": "Discard"
  },
  "download": {
    "downloadFile": "Download File",
    "downloadFolder": "Download Folder",
    "downloadSelected": "Download Selected"
  },
  "upload": {
    "abortUpload": "Are you sure you wish to abort?"
  },
  "errors": {
    "forbidden": "You don't have permissions to access this.",
    "internal": "Something really went wrong.",
    "notFound": "This location can't be reached.",
    "connection": "The server can't be reached."
  },
  "files": {
    "body": "Body",
    "clear": "Clear",
    "closePreview": "Close preview",
    "files": "Files",
    "folders": "Folders",
    "home": "Home",
    "lastModified": "Last modified",
    "loading": "Loading...",
    "lonely": "It feels lonely here...",
    "metadata": "Metadata",
    "multipleSelectionEnabled": "Multiple selection enabled",
    "name": "Name",
    "size": "Size",
    "sortByLastModified": "Sort by last modified",
    "sortByName": "Sort by name",
    "sortBySize": "Sort by size",
    "noPreview": "Preview is not available for this file."
  },
  "help": {
    "click": "select file or directory",
    "ctrl": {
      "click": "select multiple files or directories",
      "f": "opens search",
      "s": "save a file or download the directory where you are"
    },
    "del": "delete selected items",
    "doubleClick": "open a file or directory",
    "esc": "clear selection and/or close the prompt",
    "f0": "Click the .srt file with the yellow icon on the list page to launch PDJ Media Repeater.",  
    "f1": "this information",
    "f2": "rename file",
    "help": "Help"
  },
  "languages": {
    "he": "עברית",
    "hu": "Magyar",
    "ar": "العربية",
    "de": "Deutsch",
    "el": "Ελληνικά",
    "en": "English",
    "es": "Español",
    "fr": "Français",
    "is": "Icelandic",
    "it": "Italiano",
    "ja": "日本語",
    "ko": "한국어",
    "nlBE": "Dutch (Belgium)",
    "pl": "Polski",
    "pt": "Português",
    "ptBR": "Português (Brasil)",
    "ro": "Romanian",
    "ru": "Русский",
    "sk": "Slovenčina",
    "svSE": "Swedish (Sweden)",
    "tr": "Türkçe",
    "ua": "Українська",
    "zhCN": "中文 (简体)",
    "zhTW": "中文 (繁體)"
  },
  "login": {
    "createAnAccount": "Create an account",
    "loginInstead": "Already have an account",
    "password": "Password",
    "passwordConfirm": "Password Confirmation",
    "passwordsDontMatch": "Passwords don't match",
    "signup": "Signup",
    "submit": "Login",
    "username": "Username",
    "usernameTaken": "Username already taken",
    "wrongCredentials": "Wrong credentials"
  },
  "permanent": "Permanent",
  "prompts": {
    "copy": "Copy",
    "copyMessage": "Choose the location to copy your files to:",
    "currentlyNavigating": "Currently navigating on:",
    "deleteMessageMultiple": "Are you sure you wish to delete {count} file(s)?",
    "deleteMessageSingle": "Are you sure you wish to delete this file/folder?",
    "deleteMessageShare": "Are you sure you wish to stop this sharing ({path})?",
    "deleteTitle": "Delete files",
    "displayName": "Display Name:",
    "download": "Download files",
    "downloadMessage": "Choose the format you wish to download.",
    "error": "Something went wrong",
    "fileInfo": "File information",
    "filesSelected": "{count} files selected.",
    "lastModified": "Last Modified",
    "move": "Move",
    "moveMessage": "Choose new home for your file(s)/folder(s):",
    "newArchetype": "Create a new post based on an archetype. Your file will be created on content folder.",
    "newDir": "New directory",
    "newDirMessage": "Name your new directory.",
    "newFile": "New file",
    "newFileMessage": "Name your new file.",
    "numberDirs": "Number of directories",
    "numberFiles": "Number of files",
    "rename": "Rename",
    "renameMessage": "Insert a new name for",
    "replace": "Replace",
    "replaceMessage": "One of the files you're trying to upload has a conflicting name. Do you wish to skip this file and continue to upload or replace the existing one?\n",
    "schedule": "Schedule",
    "scheduleMessage": "Pick a date and time to schedule the publication of this post.",
    "show": "Show",
    "size": "Size",
    "upload": "Upload",
    "uploadFiles": "Uploading {files} files...",
    "uploadMessage": "Select an option to upload.",
    "optionalPassword": "Optional password",
    "resolution": "Resolution",
    "discardEditorChanges": "Are you sure you wish to discard the changes you've made?"
  },
  "search": {
    "images": "Images",
    "music": "Music",
    "pdf": "PDF",
    "pressToSearch": "Press enter to search...",
    "search": "Search...",
    "typeToSearch": "Type to search...",
    "types": "Types",
    "video": "Video"
  },
  "settings": {
    "admin": "Admin",
    "administrator": "Administrator",
    "allowCommands": "Execute commands",
    "allowEdit": "Edit, rename and delete files or directories",
    "allowNew": "Create new files and directories",
    "allowPublish": "Publish new posts and pages",
    "allowSignup": "Allow users to signup",
    "avoidChanges": "(leave blank to avoid changes)",
    "branding": "Branding",
    "brandingDirectoryPath": "Branding directory path",
    "brandingHelp": "You can customize how your File Browser instance looks and feels by changing its name, replacing the logo, adding custom styles and even disable external links to GitHub.\nFor more information about custom branding, please check out the {0}.",
    "changePassword": "Change Password",
    "commandRunner": "Command runner",
    "commandRunnerHelp": "Here you can set commands that are executed in the named events. You must write one per line. The environment variables {0} and {1} will be available, being {0} relative to {1}. For more information about this feature and the available environment variables, please read the {2}.",
    "commandsUpdated": "Commands updated!",
    "createUserDir": "Auto create user home dir while adding new user",
    "tusUploads": "Chunked Uploads",
    "tusUploadsHelp": "File Browser supports chunked file uploads, allowing for the creation of efficient, reliable, resumable and chunked file uploads even on unreliable networks.",
    "tusUploadsChunkSize": "Indicates to maximum size of a request (direct uploads will be used for smaller uploads). You may input a plain integer denoting byte size input or a string like 10MB, 1GB etc.",
    "tusUploadsRetryCount": "Number of retries to perform if a chunk fails to upload.",
    "userHomeBasePath": "Base path for user home directories",
    "userScopeGenerationPlaceholder": "The scope will be auto generated",
    "createUserHomeDirectory": "Create user home directory",
    "customStylesheet": "Custom Stylesheet",
    "defaultUserDescription": "These are the default settings for new users.",
    "disableExternalLinks": "Disable external links (except documentation)",
    "disableUsedDiskPercentage": "Disable used disk percentage graph",
    "documentation": "documentation",
    "examples": "Examples",
    "executeOnShell": "Execute on shell",
    "executeOnShellDescription": "By default, File Browser executes the commands by calling their binaries directly. If you wish to run them on a shell instead (such as Bash or PowerShell), you can define it here with the required arguments and flags. If set, the command you execute will be appended as an argument. This applies to both user commands and event hooks.",
    "globalRules": "This is a global set of allow and disallow rules. They apply to every user. You can define specific rules on each user's settings to override these ones.",
    "globalSettings": "Global Settings",
    "hideDotfiles": "Hide dotfiles",
    "insertPath": "Insert the path",
    "insertRegex": "Insert regex expression",
    "instanceName": "Instance name",
    "language": "Language",
    "lockPassword": "Prevent the user from changing the password",
    "newPassword": "Your new password",
    "newPasswordConfirm": "Confirm your new password",
    "newUser": "New User",
    "password": "Password",
    "passwordUpdated": "Password updated!",
    "path": "Path",
    "perm": {
      "create": "Create files and directories",
      "delete": "Delete files and directories",
      "download": "Download",
      "execute": "Execute commands",
      "modify": "Edit files",
      "rename": "Rename or move files and directories",
      "share": "Share files"
    },
    "permissions": "Permissions",
    "permissionsHelp": "You can set the user to be an administrator or choose the permissions individually. If you select \"Administrator\", all of the other options will be automatically checked. The management of users remains a privilege of an administrator.\n",
    "profileSettings": "Profile Settings",
    "ruleExample1": "prevents the access to any dotfile (such as .git, .gitignore) in every folder.\n",
    "ruleExample2": "blocks the access to the file named Caddyfile on the root of the scope.",
    "rules": "Rules",
    "rulesHelp": "Here you can define a set of allow and disallow rules for this specific user. The blocked files won't show up in the listings and they wont be accessible to the user. We support regex and paths relative to the users scope.\n",
    "scope": "Scope",
    "setDateFormat": "Set exact date format",
    "settingsUpdated": "Settings updated!",
    "shareDuration": "Share Duration",
    "shareManagement": "Share Management",
    "shareDeleted": "Share deleted!",
    "singleClick": "Use single clicks to open files and directories",
    "themes": {
      "dark": "Dark",
      "light": "Light",
      "title": "Theme"
    },
    "user": "User",
    "userCommands": "Commands",
    "userCommandsHelp": "A space separated list with the available commands for this user. Example:\n",
    "userCreated": "User created!",
    "userDefaults": "User default settings",
    "userDeleted": "User deleted!",
    "userManagement": "User Management",
    "userUpdated": "User updated!",
    "username": "Username",
    "users": "Users"
  },
  "sidebar": {
    "transcribe1": "generate .srt subtitle file for media",
    "transcribe": "Media Transcription",    
    "subTransfer": "Subtitles Conversion",
    "subTransfer1": "Supports batch conversion between SRT, LRC, ASS, and VTT subtitle formats.",   
    "help": "Help",
    "hugoNew": "Hugo New",
    "login": "Login",
    "logout": "Logout",
    "myFiles": "My files",
    "newFile": "New file",
    "newFolder": "New folder",
    "preview": "Preview",
    "settings": "Settings",
    "signup": "Signup",
    "siteSettings": "Site Settings"
  },
  "success": {
    "linkCopied": "Link copied!"
  },
  "time": {
    "days": "Days",
    "hours": "Hours",
    "minutes": "Minutes",
    "seconds": "Seconds",
    "unit": "Time Unit"
  }
}
